In [4]:
import pandas as pd

employee_data = {'employee_id' : ['1','2','3','4'],
                 'name' : ['amy jones','allen keys', 'alice bees','tim horton']}

dataframe_name = pd.DataFrame(employee_data, columns = ['employee_id', 'name'])

In [6]:
sales_data = {'employee_id' : ['3','4','5','6'],
              'total_sales' : [23456,78910,25251,68945]}

dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id','total_sales'])

total = pd.merge(dataframe_name, dataframe_sales, on = 'employee_id')
#pd.merge(df1, df2, on='공통열', how='inner')

In [7]:
total.head()

  employee_id        name  total_sales
0           3  alice bees        23456
1           4  tim horton        78910